#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-04-30T20:30:16Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:445131834497:v1o7d57660/" -> (known after apply)
      ~ id            = "2eb5x0" -> (known after apply)
      ~ invoke_url    = "https://v1o7d57660.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-04-30T20:30:15Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "2eb5x0" -> (known after apply)
        id                    = "ags-v1o7d57660-demo"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.save_metrics_average_duration will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "save_metrics_average_duration" {
      ~ alarm_description         = "This metric monitors average duration for the backoff_retry lambda" -> "This metric monitors average duration for the save_metrics lambda"
      ~ dimensions                = {
          ~ "FunctionName" = "backoff_retry" -> "save-metrics"
        }
        id                        = "save-metrics-average-duration"
        tags                      = {}
        # (15 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_update_function_policy will be created
  + resource "aws_iam_policy" "lambda_update_function_policy" {
      + arn         = (known after apply)
      + description = "Allow for updates to Lambda functions and their configuration"
      + id          = (known after apply)
      + name        = "AllowLambdaUpdateFunction"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:UpdateFunctionConfiguration",
                          + "lambda:UpdateFunctionCode",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ca-central-1:445131834497:function:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
    }

  # aws_iam_user.github_actions will be updated in-place
  ~ resource "aws_iam_user" "github_actions" {
        id                   = "pipeline_ecr"
      ~ name                 = "pipeline_ecr" -> "github_actions"
      - permissions_boundary = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser" -> null
        tags                 = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_user_policy_attachment.github_actions_lambda_update_function_policy_attach will be created
  + resource "aws_iam_user_policy_attachment" "github_actions_lambda_update_function_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "github_actions"
    }

  # aws_iam_user_policy_attachment.github_actions_power_user_policy_attach must be replaced
-/+ resource "aws_iam_user_policy_attachment" "github_actions_power_user_policy_attach" {
      ~ id         = "pipeline_ecr-20210430182403207500000001" -> (known after apply)
      ~ user       = "pipeline_ecr" -> "github_actions" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 3 to change, 2 to destroy.

Changes to Outputs:
  ~ base_url = "https://v1o7d57660.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @patheard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*